{"pageContext":{"_pageId":"/src/pages/blog/@post/index","pageProps":{"post":"thinkpad-x330","pageHtml":"<div class=\"w-5/6 sm:w-3/4 md:w-4/6 lg:w-3/5 xl:w-2/5 flex flex-col gap-6\"><h1 class=\"text-3xl font-bold\">ThinkPad x230 (x330)</h1>\n<p>This blog post will be a documentation of upgrading a ThinkPad x230.</p>\n<p>When I started college, I knew I needed a laptop. There were plenty of options to choose from, but for whatever reason I\nfell in love with the design of the ThinkPad x230... and I stumbled down the rabbithole of decking the heck out of this\nparticular laptop.</p>\n<p>The community involving ThinkPads is so great, there are so many cool mods and documentation on this\nlaptop that I felt inclined to get one and learn from these great people.</p>\n<p>It is definitely an old laptop. So by the time anyone reads this post, I wouldn&#x27;t recommend going through the process of\nupgrading it like me (since the hardware of this laptop is really old), unless you want to do it for the experience of course.</p>\n<div class=\"rounded-md border-2 border-yellow-500 text-yellow-500 text-sm p-2\">\nIf you are reading this, this is not meant to be a guide or how-to. \nOnly reference from here if you are troubleshooting anything, especially the coreboot section.\n</div>\n<h2 class=\"text-2xl font-bold\">Upgrading soldered CPU</h2>\n<p>Unfortunately, the CPU on this laptop is soldered and the one that I had was an i5.\nI knew I wanted a more powerful one, so the only obvious choice would be to buy a new\nboard with a better CPU soldered in.</p>\n<p>This laptop was only manufactured with the following Ivy Bridge (3rd gen) CPUS:\n| i7-3520M | i5-3360M | i5-3320M |\n|-|-|-|</p>\n<p>However, these are all dual core... which is starting to show its age. Fortunately, modders of the ThinkPad\ncommunity have figured out that the board supports other processors by performing BGA rework.\n| i7-3615QE\t| i7-3612QE | i7-3540M | i7-3687U\t| i7-3689Y |\n|-|-|-|-|-|</p>\n<p>I don&#x27;t have the skills to perform a BGA rework, but fortunately there are sellers that sell a x230 motherboard\nwith the BGA rework already done. So I ended up buying a i7-3615QE which is a quad-core variant.\nFrom <a href=\"https://www.aliexpress.us/item/3256804255152457.html\" class=\"underline underline-offset-2 text-red-300\">AliExpress</a>.</p>\n<p>Unfortunately, the board arrived with a broken backlight fuse... so I had to solder a bridge on the fuse\n(which I eventually replaced with a working fuse).</p>\n<div class=\"flex gap-x-4\">\n<p><img src=\"/blog/x230/jumped_fuse.jpg\" alt=\"\"/>\n<em>image caption: jumped backlight fuse</em></p>\n<p><img src=\"/blog/x230/new_cpu_works.jpg\" alt=\"\"/>\n<em>image caption: it&#x27;s alive</em></p>\n</div>\n<h2 class=\"text-2xl font-bold\">Upgrading the screen</h2>\n<p>With the new i7-3615QE board ready, it was time for me to do a screen upgrade.</p>\n<p>The laptop is capable of taking non-stock panel upgrades if you use a panel mod board. At the time of writing,\nthere are two community produced boards avaliable:</p>\n<p>| <a href=\"https://nitrocaster.me/store/x220-x230-fhd-mod-kit.html\" class=\"underline underline-offset-2 text-red-300\">Nitrocaster</a> | a.gain <a href=\"https://www.aliexpress.us/item/3256804035467492.html\" class=\"underline underline-offset-2 text-red-300\">1080p</a>/<a href=\"https://www.aliexpress.us/item/3256804036188775.html\" class=\"underline underline-offset-2 text-red-300\">2k</a> |\n|-|-|</p>\n<p>I initially went for the Nitrocaster, which I had bought 4(?) years before my plan of creating this laptop. This board hasn&#x27;t been stocked\nsince the time I bought it.</p>\n<div>\n<figure style=\"float:right;margin:0 0 0 15px;text-align:center;width:25%\">\n  <img src=\"/blog/x230/oh_fuck.jpg\"/>\n  <figcaption class=\"text-xs\">image caption: oh fuck</figcaption>\n</figure> \n<p>\nThe soldering of the board was not difficult to me, however the entirity of this DIY did not ever go to plan. \nI had broken the screen multiple times in the process (2x broken screens), so if you are planning on doing this, don&#x27;t be reckless\nlike me... \n<br/><br/>\nAnyways, the Nitrocaster worked... sort of. For whatever reason, it had issues with the backlight not coming on\nat BIOS which really, really annoyed me. I did not have the technical expertise to find out what was causing it.\n<br/><br/>\nSo I ended up also getting an a.gain board, which turned out to be a better mod because there were 2k panel options compared to the\nNitrocaster.\n</p>\n</div>\n<p>The modding experience was way better on this board in my opinion.</p>\n<h2 class=\"text-2xl font-bold\">Misc. hardware modifications</h2>\n<p>I opted to use a x220 keyboard in place of the x230 keyboard. The community prefers the older style keyboard and figured out a way\nto get it patched with EC firmware and get it working properly on a x230 board.</p>\n<p>I also upgraded the wifi card to a AX200 with bluetooth. This would require me to flash the bios remove the whitelist in order to use it.</p>\n<h2 class=\"text-2xl font-bold\">Coreboot</h2>\n<p>With the hardware mods in place, it was time to flash an open-source BIOS called Coreboot... the most time consuming part of the whole operation.</p>\n<h3 class=\"text-xl font-bold\">Hardware tools</h3>\n<p>There are many ways to get the hardware setup for flashing the BIOS chip. This is the list of tools that I used:\n| 8-pin SOIC test clip | Raspberry Pi 4 |\n|-|-|</p>\n<p>A lot of other guides use a CH341a which omits the use of a Raspberry Pi, but at the time it was what I already had laying around so I&#x27;d\nfigure to use the pi instead.</p>\n<p><img src=\"/blog/x230/operating_table.jpg\" alt=\"\"/>\n<em>image caption: the operating table</em></p>\n<p>The tricky part was getting 3.3v to the chip, but the Raspberry Pi did not have a stable voltage to do so. Fortunately, if you enable\nWake-on-LAN in the stock bios and plug in Ethernet, that should be enough to satisfy the 3.3v requirement.</p>\n<p>For reference, I used the following guides for figuring out how to flash coreboot:</p>\n<ul class=\"list-disc ml-4\">\n<li>https://www.chucknemeth.com/laptop/lenovo-x230/flash-lenovo-x230-coreboot</li>\n<li>https://www.xyte.ch/support/x330-support/x330-bios</li>\n<li>https://stafwag.github.io/blog/blog/2022/01/21/install_coreboot_on_x230</li>\n</ul>\n<p>The information is really scattered across the internet and a lot of stuff is not up-to-date. So if you are planning on doing this, please\nread carefully.</p>\n<h3 class=\"text-xl font-bold\">Compiling and flashing</h3>\n<p>This was by far the most difficult part, as many of the guides found online are years old, a lot of the build process I would had to figure\nout myself. The part that gave me the most trouble was figuring out how to configure coreboot with a FHD patch and a custom splashscreen.</p>\n<p>I had to clone the coreboot respository and cherry-pick a user patch that still hasn&#x27;t merged, and I soon find out why. The amount of people\nrunning and doing the same setup was probably in the dozens. This means that there isn&#x27;t much support or testing, probably why the PR went stale.</p>\n<p>In the end, I figured it out and was able to build successfully! So I tried flashing it for the first time...</p>\n<p><img src=\"/blog/x230/oh_shit.jpg\" alt=\"\"/>\n<em>image caption: holy shit what the fuck</em></p>\n<p>Okay, this is probably not supposed to happen... and had me worrying that I might have messed something up badly. So I went through the config\nsettings a couple of times, reflashed, and got this:</p>\n<p><img src=\"/blog/x230/bios_for_ants.jpg\" alt=\"\"/>\n<em>image caption: what is this? a bios for ants?</em></p>\n<p>Something readable! Kinda... the screen&#x27;s resolution is high for the size so when displaying the bios in native resolution it makes it look so tiny...\nback to the config.</p>\n<p><img src=\"/blog/x230/splash_works.jpg\" alt=\"\"/>\n<em>image caption: wow that screen is very dusty</em></p>\n<p>It&#x27;s finally scaled up to a reasonable resolution, but not without problems.</p>\n<p>After messing with the config and flashing multiple times (at least 20 times), I settled after this attempt.</p>\n<p>The resolution is good enough for the BIOS, but for some reason the splash screen only appeared for less than half a second\ncompared to the other configurations. I&#x27;m not sure why, but honestly after so many flash attempts I don&#x27;t really care anymore, this is enough for now.</p>\n<h1 class=\"text-3xl font-bold\">Conclusion</h1>\n<p><img src=\"/blog/x230/i_use_arch_btw.jpg\" alt=\"\"/>\n<em>image caption: i use arch btw.</em></p>\n<p>It works! i7-3615QE with a resolution of 2560x1440!</p>\n<p>The adventure for this was very rocky, I had put this off and on countless of times throughout the years until now to achieve this level of satisfaction.</p>\n<p>However, there were a lot of things that I had troubles with and still isn&#x27;t <em>perfect</em>. So I may have to revisit this in the future and possibly try again.</p>\n<p>Thanks for reading this far. I hope it was enjoyable to read and maybe useful, since I didn&#x27;t want to write a full blown tutorial on how to do this. Although\nfeel free to reach out if you do need more information or help.</p>\n<p>This blog post may be updated/revised in the future.</p></div>"},"documentProps":"!undefined","someAsyncProps":"!undefined"}}